app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."guest" = ?  ORDER BY "games"."id" DESC LIMIT 1  [["guest", "43ea91aba679df69ee5f0793538f3e46"]]
SELECT  "cells".* FROM "cells" WHERE "cells"."game_id" = ? AND "cells"."name" = ? LIMIT 1  [["game_id", 3], ["name", "c6"]]
UPDATE "cells" SET "marked" = ?, "updated_at" = ? WHERE "cells"."id" = ?  [["marked", "t"], ["updated_at", "2016-03-22 06:18:18.604133"], ["id", 1064]]
UPDATE "games" SET "game_result" = ?, "times" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["game_result", "Поражение"], ["times", 1458623917], ["updated_at", "2016-03-22 05:18:37.457352"], ["id", 3]]
SELECT COUNT(*) FROM "cells" WHERE "cells"."game_id" = ? AND "cells"."opened" = ?  [["game_id", 3], ["opened", "f"]]
---
    def click
        # поиск последней игры пользователя
        @game = current_user ? Game.where(user_id: current_user.id).last : Game.where(guest: session[:guest]).last
        if @game.game_result == 'none' # если игра идет
            cell = @game.cells.find_by(name: "#{params[:name]}") # найти ячейку
            if cell.opened # если ячейка открывалась, то ничего
                render nothing: true
            else # если не открывалась
                if cell.marked # если была отмечена флагом, то убирается флаг
                    @cell_list = cell.marking(false)
                else # если не была отмечена флагом, то
                    @cell_list = params[:click] == '1' ? cell.check_cell : (@cell_list = cell.marking(true)) # если клик левой (1), то открывает ячейку, если правой (не 1) - ставит флаг
                end
                @game.update(starttime: Time.current.to_i) if @game.starttime == 0 # ставит время запуска игры после первого хода
                @game.update(game_result: 'Победа', times: (Time.current.to_i - @game.starttime)) if @game.cells.where(opened: false).count == @game.mines_count # если не открыто ячеек столько же, сколько мин, то победа

SELECT "games".* FROM "games" WHERE "games"."user_id" = ? AND "games"."game_result" = ?  ORDER BY "games"."times" ASC  [["user_id", 1], ["game_result", "Победа"]]
SELECT COUNT(*) FROM "games" WHERE "games"."user_id" = ? AND "games"."game_result" = ?  [["user_id", 1], ["game_result", "none"]]
---
    def profile
        # сбор побед и поражений для статистики при входе в профиль
        games = Game.where(user_id: current_user.id).order(times: :asc)
        @wins = games.where(game_result: 'Победа')
        @defeat_count = games.where(game_result: 'Поражение').count